{"pageNames":{"home":"<p>Home</p>","projects":"Projects","services":"Services","about":"About","contact":"Contact"},"projects":{"projectDescription":"As a multidisciplinary firm, we maintain considerable experience, skills and resources to undertake a wide variety of projects. NDG was started in 1999 and serves a local and national client base. Customers recognize the firm’s ability to provide and coordinate a broad spectrum of specialized professional services through our highly qualified staff  and the use of an extensive professional","viewProjectsButton":"View All Projects","viewProjectLink":"View Project","startExploring":"Start Exploring","back":"back","next":"next","filter":"Works Filter"},"projectDetails":{"projectDetails":"Project Details","owner":"Owner","location":"Location","area":"Area","builtUpArea":"Built Up Area","year":"Date of Completion","gallery":"Gallery","videoPresentations":"Video Presentations","images":"Images","videos":"Videos"},"services":{"whatWeDo":"What We Do","description":"NATURE Design Group (NDG) is a full-service professional firm that provides Strategic & regional planning ,urban design, landscape architecture, architecture, interior design and, engineering services in all key engineering disciplines: mechanical, electrical, structural, civil, sanitary, and fire protection. Known as a leader in Smart Growth and sustainable planning and building practices, the firm designs redevelopment and revitalization plans for cities and towns that have all the elements needed to create vibrant and economically vital urban environments."},"about":{"aboutUs":"About Us","corporateOverview":"Corporate Overview","corporateOverviewText":"<p><strong>NATURE Design Group (NDG)</strong> is a full-service professional firm that provides Strategic &amp; regional planning ,urban design, landscape architecture, architecture, interior design and, engineering services in all key engineering disciplines: mechanical, electrical, structural, civil, sanitary, and fire protection. Known as a leader in Smart Growth and sustainable planning and building practices, the firm designs redevelopment and revitalization plans for cities and towns that have all the elements needed to create vibrant and economically vital urban environments.</p><p>As a multidisciplinary firm, we maintain considerable experience, skills and resources to undertake a wide variety of projects. NDG was started in 1990 and serves a local and national client base. Customers recognize the firm’s ability to provide and coordinate a broad spectrum of specialized professional services through our highly qualified staff and the use of an extensive professional network of service companies.</p><p>We offer expertise in all aspects of statutory planning including site analysis, planning applications and scheme amendments, appeals representation and evidence and landscape design. The firm's statutory planning expertise is complemented by its urban design and landscape design skills, enabling a comprehensive approach to the resolution of planning issues.</p><p>The key to our approach is the understanding of our clients' current needs and future requirements. We appreciate that every client is unique and each project requires an individually tailored strategy to enable suitable solutions.</p>","motivation":"Motivation","motivationText":"<h2>Work Motivation</h2><p>The NDG team is motivated by the high level of expertise and experience we can give to our Clients. Where Partnering Agreements exist, NDG are specifically focused on delivering the Agreed Maximum Prices at the earliest time and endeavor to coordinate an early input from</p><p>the Constructor and preferred Sub Constructors where appropriate. In addition, our Sub Consultants, where required, are very familiar too with the design process surrounding future Local Authority projects.</p><p>NDG employ a serious approach to whole life costs for the projects. We are familiar with WLC process and have the commitment to deliver on all our projects. We will explore functional effectiveness a response to context along with exploitation of natural resources such as views, light, sun etc.,</p><p>We will identify how making routes and entrances easily identifiable, articulation of elements and spaces with real purpose, practicality and environmental efficiency, identity, character and beauty resulting in integrity of the whole.</p><p>We understand sustainable development to mean making sure that the individual project and developments we provide today do not affect the ability of future generations to undertake their own development. Essentially, we aim to minimize the environmental impact of the new project both during construction and over its lifetime.</p><h1>Our Approach</h1><h2>Business Philosophy</h2><p>Our business philosophy comes from the heart of our organization and centers on going the extra mile to meet and exceed your needs and expectations while delivering the greatest value. It reflects our personal values and our corporate culture. At NDG, we measure our degree of excellence by:</p><ul><li>Striving to fully understand and exceed our clients’ expectations.</li><li>Developing and maintaining the highest level of integrity by practicing teamwork, honesty and respect for the individual.</li><li>Taking pride and ownership in everything we do.</li><li>Advancing our firm’s professional image and reputation through leadership in our company, industry and community.</li></ul><p>NDG Company’s approach is successful because our ultimate goal is to help you succeed.</p><h2>Focus on Technology</h2><p>Our commitment to being leaders in our industry keeps us at the forefront of technological advances. Leading-edge technology allows us to utilize state-of-the-art design processes that ultimately result in faster, better design solutions for you. We are committed to continually investing in our technology infrastructure and most importantly our people, by way of training and providing a challenging professional environment. Following are a few of the leading-edge technologies we use every day.</p><h3><strong>Building Information Modeling (BIM)</strong></h3><p>NDG utilizes Autodesk Revit to develop state of the art 3-D design models which incorporate non-graphical information such as: fire ratings of architectural components; quantities and types of steel, concrete and HVAC components; and three dimensional design data. BIM allows our design teams to better communicate design concepts, easily incorporate client feedback and provide better coordinated documents to contractors, either in 3-D or more traditional formats. This leading-edge design technology saves you time and money by providing 3-D visualization and richer data throughout the design process allowing for more informed decisions which can result in fewer change orders and requests for information. In addition to Revit, we also use Autodesk Navisworks to for purposes of interference checking, phasing and scheduling.</p><h3><strong>3-D Rendering Capabilities</strong></h3><p>BIM enables project teams to consider the entire life cycle of a building (design-build- operation) through 3-D simulation – including fly-through visualization – to help you virtually experience the facility at each stage of design. This enables you to virtually walk through the facility and make on-the-spot design decisions as needed in order to meet project goals.</p><p>We can also create 3-D building models and fly-through visualizations for planning purposes, without requiring the time and budget to develop detailed BIM models. Tools such as 3d-Max, Accurender and Google’s Sketchup allow you to see the aesthetic effects of architectural design decisions and visualize how a proposed development will look in relation to existing buildings and roads. Planned community developments can even be viewed using Google Earth to see the impact of proposed building on adjacent areas from virtually any viewpoint.</p><p>Ultimately, the NDG Team’s 3-D Modeling capabilities will save you time, money and the risk of contractor delays by providing the critical information needed throughout the design process to make better informed decisions.</p><h3><strong>Cloud Computing</strong></h3><p>NDG is actively researching and testing the use of cloud computing to facilitate interaction and collaboration between multiple offices. The increasing demand on our information systems has required a creative solution and cloud computing allows remote users to participate in projects with little or no disruption to the project workflow. In addition to allowing project access for remote users, cloud computing also provides our designers with additional computing horsepower for processing intensive tasks such as 3-D rendering allowing desktop resources to be utilized for less intensive production operations.</p><h3><strong>CADD Resources</strong></h3><p>NDG has full in-house rendering and 3D modeling capabilities using 3D Studio Max with Adobe Premier, Illustrator, and After Effects. All of our projects are now designed via AutoCAD in 3D. Our CADD resources include:</p><ul><li>MicroStation, Version 8</li><li>AutoCAD, Version 2007</li><li>Architectural Desktop (3D)</li><li>AutoCAD Map (for GIS capability)</li><li>MS Project, CSI for construction specifications</li><li>Database</li><li>Numerous Discipline-Specific Technical Design Programs.</li></ul><h2>Design Approach</h2><p>The NDG Practice would be lead on design and function as contract administrators where the Contract permits. As Lead Consultants for existing Framework Agreements we also act as Lead Consultants. An Associate would be actively involved in the design of the project, with the Architect taking the lead role as the project architect. The Associate would be supported by our team of experienced architects and architects assistants.</p><p>A designated person will manage overall project co-ordination, focusing on client access to the design team, value, risk, design and production management and programming. Cost planning, value engineering and robust cost control at key stages will be provided by the design team in general and the quantity surveyor in particular. Structural and Drainage design will be provided by the appointed structural engineer and building service engineer. An integrated environmental strategy will be provided at the earliest design stages by Building Services Engineer.&nbsp;</p><p>CDM Planning Supervisor too will be appointed by the Client. The whole team will follow the project - specific design management and quality control procedures which The NDG Practice will put in place. We are very much \"team workers\" and at the earliest stage we would seek the establishment of a Project Management Group which would include representatives from the Design Team, Client representative, careers and community stakeholders as appropriate.</p><h1>Our Mission</h1><h3>Ongoing Missions</h3><p>NATURE Design Group (NDG)is comprised of professionals who are passionate in their dedication to environmental responsibility and sustainability from large-scale community and land use planning to the design and construction of truly innovative and sustainable projects. We are professional planners, Architects, landscape architects; and, we’re all passionate about the environment and creating spaces that intrinsically enhance quality of life today and for future generations.</p><p>We bring a full-service approach to private, public and not-for-profit clients who value a comprehensive, systems approach to sustainability. Our Sustainability aims to employs an ecological perspective to address complex issues in urban, rural or suburban landscapes.</p><p>Our staff is committed to bringing you innovative, responsive, design solutions that utilize sustainable practices and advance our mission. We advocate for a balanced solution that integrates natural and built systems.</p><p>This balance is at the core of all our projects, facilitating placemaking and landscapes that are not only memorable, but stand the test of time.</p><p>Sustainability is the foundation of every solution within NDG Studio. The confluence of environmental sensitivity, economic responsibility and social equity is integral to every design and planning decision, influencing our present actions and guiding our future legacy. Whether through campus master planning, community visioning workshops or parks and greenway trails, we integrate sustainable practices into every project.</p><p>Our Sustainability Studio collaborates with all groups within NDG to bring sustainable practices to the forefront of every project through internal committees – such as our Green Committees, Technical, Marketing and Corporate — and design charrettes, guaranteeing that staff expertise is afforded at all scales. Equally important, the landscape architects, planners and urban designers at NDG are technically fluent, providing superior graphics that facilitate the understanding of often complex design solutions.</p><p>Sustainable design practices are incorporated into every one of our master plans, and ensuring their viability is our primary commitment. We believe that the natural systems simply cannot be ignored while designing for people. Rather, it is this very connection to the surrounding environment that we believe forms the bond between people and place. Within the NDG Sustainability Studio, the implementation of sustainable design practices is at the heart of every design decision we make.</p><p>“Sustainable development is development that meets the needs of the present without compromising the ability of future generations to meet their own needs.”</p><p>UN World Commission on Environment and Development</p><p>“Our Common Heritage”</p><p>The Brundtland Report</p><p>Our Mission for Protecting the Environment, and providing Sustainability</p><p>We believe sustainability should be an integral and essential part of any thinking about new project development today. We aim to minimize the environmental impact of projects both during construction and over their lifetime, and this forms the basis of our approach.</p><p>Sustainability is often the key differentiator for a development proposal. It marks out a special scheme from the ordinary. It is increasingly important for planners, local authorities, development agencies, funders and customers. But it can come at a cost, and our strength is our awareness of the issues and a pragmatic and intelligent approach to design, which ensures that we obtain the best value whilst meeting environmental objectives. In many cases careful design will mean that simple but effective project services solutions will meet the brief without resorting to expensive and complicated systems.</p><p>Our usual approach is to undertake an initial appraisal of the scheme which identifies the key issues of environmental sensitivity and which allows clients to make informed decisions about projects by providing them with objective assessments about the effectiveness and environmental impact of development proposals. We will then develop proposals in conjunction with the rest of the design team and monitor performance against agreed benchmarks.</p><h2>People</h2><p>While our talent sets us apart, it’s our people that make NDG stand above in design innovation, technical expertise, service quality and client responsiveness. Our talented professionals are passionate and committed to going the extra mile to meet your specific project needs.</p><p>We believe having professionals from all disciplines under one roof helps us deliver greater value and higher quality, as well as achieve an environment of optimum growth for our people and our firm. We encourage a team environment and open communication between disciplines, which innately becomes an environment of continual learning and innovation. This constant learning environment is of significant value to you because we deliver solutions and solve issues quicker, easier and with optimum results, ultimately saving you time and money.</p><p>NDG professionals continually strive for innovation and enjoy developing lasting relationships with our clients. It’s always our goal to become a real partner with each and every client. To achieve this, we encourage a culture of open, honest and regular communication both internally and externally. We have technology and process to support easy, convenient and continual communication. We believe in empowering our people to bring new, fresh ideas to the table with open dialogue and always an “open door policy”. In doing this, we believe we create an exceptional working environment and ultimately deliver higher quality results to you.</p><p>Our people represent the best in our industry.</p><h3>We are… Responsive People. <strong>Real Partners.</strong></h3><p><br></p>","bua":"Millions BUA","projects":"Projects","years":"18+ Years"},"contact":{"contactUs":"Contact Us:","write":"write:","call":"call:","visit":"visit:","visitText":"F41, 4TH FLOOR, BUILDING NO.6 AL‐GIHAD ST., LEBANON SQUARE, MOHANDESSIN ,GIZA, EGYPT","getInTouch":"GET IN TOUCH","name":"Name","email":"Email","phone":"Phone","subject":"Subject","orderProject":"Order Project","support":"Support","otherQuestions":"Other Questions","message":"Message","send":"Send","getInTouchText0":"NATURE DESIGN GROUP CO. - N.D.G","getInTouchText1":"SINCE 1999","getInTouchText2":"ARCHITECTURE–URBAN PLANNING –INFRASTRUCTURE PLANNING -URBAN DESIGN – LANDSCAPE ARCHITECTURE","getInTouchText3":"STRUCTURAL ENGINEERING – FEASIBILITY STUDIES ADDRESS: F41, 4TH FLOOR, BUILDING NO.6 AL‐GIHAD ST.,LEBANON SQUARE, MOHANDESSIN ,GIZA, EGYPT","getInTouchText4":"<p>POSTAL CODE 12411</p>","getInTouchText5":"<p>DUBAI :OFFICE NO. 503‐06 ACICO GULF REAL ESTATE DUBAI BRANCH ,PORTSAID.</p>","getInTouchText6":"<p>POSTAL CODE : 393210</p>"}}